a5021/STM32F401CCU6-Blink-Bare-Metal/inc/main.h
  GPIOA->PUPDR = (
#ifndef SWD_DISABLED
    PIN_CONF(PIN(14), PIN_PULL_UP)      | /* PA14 AF0 -- SYS_SWDCLK           */
    PIN_CONF(PIN(13), PIN_PULL_DOWN)    | /* PA13 AF0 -- SYS_SWDIO            */
#endif
    PIN_CONF(PIN(1),  PIN_PULL_UP)        /* PA1  INPUT PULL-UP               */
  );

  SW_PIN(C, PIN_HIGH(13));                /* SET GPIOC PIN 13 HIGH            */

  GPIOC->MODER = ALL_ANALOG - (           /* Configure GPIOC                  */
    PIN_CONF(PIN(13), PINV_OUTPUT)        /* PA13 OUTPUT PUSH-PULL            */
  );
}

__STATIC_INLINE void init_usart(uint32_t baudrate) {
  USART6->BRR = UART_BAUDRATE(100 MHZ, baudrate);
  USART6->CR1 = (           /* 0x4001140C: USART Control register 1, Address offset: 0x0C     */
    0 * USART_CR1_SBK    |  /* (1 << 0)    Send Break                             0x00000001  */
    0 * USART_CR1_RWU    |  /* (1 << 1)    Receiver wakeup                        0x00000002  */
    0 * USART_CR1_RE     |  /* (1 << 2)    Receiver Enable                        0x00000004  */
    1 * USART_CR1_TE     |  /* (1 << 3)    Transmitter Enable                     0x00000008  */
    0 * USART_CR1_IDLEIE |  /* (1 << 4)    IDLE Interrupt Enable                  0x00000010  */
    0 * USART_CR1_RXNEIE |  /* (1 << 5)    RXNE Interrupt Enable                  0x00000020  */
    0 * USART_CR1_TCIE   |  /* (1 << 6)    Transmission Complete Interrupt Enable 0x00000040  */
    0 * USART_CR1_TXEIE  |  /* (1 << 7)    TXE Interrupt Enable                   0x00000080  */
    0 * USART_CR1_PEIE   |  /* (1 << 8)    PE Interrupt Enable                    0x00000100  */
    0 * USART_CR1_PS     |  /* (1 << 9)    Parity Selection                       0x00000200  */
    0 * USART_CR1_PCE    |  /* (1 << 10)   Parity Control Enable                  0x00000400  */
    0 * USART_CR1_WAKE   |  /* (1 << 11)   Wakeup method                          0x00000800  */
    0 * USART_CR1_M      |  /* (1 << 12)   Word length                            0x00001000  */
    1 * USART_CR1_UE     |  /* (1 << 13)   USART Enable                           0x00002000  */
    0 * USART_CR1_OVER8     /* (1 << 15)   USART Oversampling by 8 enable         0x00008000  */
  );
}

// #if defined(__clang__) && !defined(__CC_ARM)
//   #pragma clang diagnostic ignored "-Wextra-semi-stmt"
// #elif defined(__CC_ARM)
//     #pragma diag_suppress 1293
// #endif

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
